app/views/professors/show.html.erb

<tbody>
    <% @professor.students.each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."professor_id" = $1  [["professor_id", 1]]