app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    if @course.save
---
INSERT INTO "courses" ("prefix", "name", "number", "section", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["prefix", "Test1"], ["name", "This is a test"], ["number", 12], ["section", 3], ["created_at", "2021-02-18 02:30:35.108132"], ["updated_at", "2021-02-18 02:30:35.108132"]]

  def update
    @course = Course.find(params[:id])

    if @course.update(course_params)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "courses" SET "section" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["section", 11], ["updated_at", "2021-02-18 02:36:52.926118"], ["id", 1]]