app/controllers/plans_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @student = Student.find(params[:student_id])
    @plan = Plan.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "plans" ("created_at", "updated_at", "nameofplan", "student_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2021-03-07 21:45:38.250764"], ["updated_at", "2021-03-07 21:45:38.250764"], ["nameofplan", "asdfaf"], ["student_id", 1]]
---
  def create
    @student = Student.find(params[:student_id])
    @plan = @student.plans.create(plan_params)

SELECT "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "plans" WHERE "plans"."id" = $1  [["id", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    @plan = Plan.find(params[:id])
    @plan.destroy

    @student = Student.find(params[:student_id])