app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    @professors = Professor.find(params[:id])