app/controllers/professors_controller.rb

  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save
---
INSERT INTO "professors" ("Name", "CWID", "created_at", "updated_at", "programdirector_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["Name", "John Kreisler"], ["CWID", 534], ["created_at", "2021-04-20 20:56:17.691701"], ["updated_at", "2021-04-20 20:56:17.691701"], ["programdirector_id", 1243]]