app/controllers/programdirectors_controller.rb

  def index
    @professor = User.professors
    @students = User.students
    @courses = []#Course.all
---
SELECT "courses".* FROM "courses"

  def show
    @professor = Professor.find(params[:id])
    @students = Student.find(params[:id])
---
SELECT "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @programdirector = Programdirector.find(params[:id])
---
SELECT "programdirectors".* FROM "programdirectors" WHERE "programdirectors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]