app/controllers/programdirectors_controller.rb

SELECT "programdirectors".* FROM "programdirectors"
---
  def index
    @programdirectors = Programdirector.all

SELECT "programdirectors".* FROM "programdirectors" WHERE "programdirectors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @programdirector = Programdirector.find(params[:id])

INSERT INTO "programdirectors" ("Name", "CWID", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["Name", "Mike"], ["CWID", 101], ["created_at", "2021-04-14 16:27:28.320696"], ["updated_at", "2021-04-14 16:27:28.320696"]]
---
  def create
    @programdirector = Programdirector.new(programdirector_params)

    if @programdirector.save

SELECT "programdirectors".* FROM "programdirectors" WHERE "programdirectors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @programdirector = Programdirector.find(params[:id])

SELECT "programdirectors".* FROM "programdirectors" WHERE "programdirectors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "programdirectors" SET "Name" = $1, "updated_at" = $2 WHERE "programdirectors"."id" = $3  [["Name", "Joe Mama"], ["updated_at", "2021-03-24 20:38:16.859140"], ["id", 1]]
---
  def update
    @programdirector = Programdirector.find(params[:id])

    if @programdirector.update(programdirector_params)