app/controllers/semesters_controller.rb

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @semester = Semester.find(params[:id])

INSERT INTO "semesters" ("course1", "course2", "course3", "course4", "created_at", "updated_at", "season", "year") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @semester = current_user.semesters.new(semester_params)
    if @semester.save

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @semester = Semester.find(params[:id])

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "semesters" SET "course1" = $1, "course2" = $2, "course3" = $3, "course4" = $4, "updated_at" = $5 WHERE "semesters"."id" = $6  [["course1", ""], ["course2", ""], ["course3", ""], ["course4", ""], ["updated_at", "2021-04-08 14:41:09.647099"], ["id", 1]]
---
  def update
    @semester = Semester.find(params[:id])

    if @semester.update(semester_params)

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "semesters" WHERE "semesters"."id" = $1  [["id", 4]]
---
  def destroy
    @semester = Semester.find(params[:id])
    @semester.destroy