app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("Name", "CWID", "Concentration", "Advisor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["Name", "Billy Jean"], ["CWID", 12345678], ["Concentration", "Computer Science"], ["Advisor", "Dr. V"], ["created_at", "2021-02-19 15:30:21.358280"], ["updated_at", "2021-02-19 15:30:21.358280"]]